//一些常用的正则表达式 
//"^\d+$"　　//非负整数（正整数 + 0） 
//"^[0-9]*[1-9][0-9]*$"　　//正整数 
//"^((-\d+)|(0+))$"　　//非正整数（负整数 + 0） 
//"^-[0-9]*[1-9][0-9]*$"　　//负整数 
//"^-?\d+$"　　　　//整数 
//"^\d+(\.\d+)?$"　　//非负浮点数（正浮点数 + 0） 
//"^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$"　　//正浮点数 
//"^((-\d+(\.\d+)?)|(0+(\.0+)?))$"　　//非正浮点数（负浮点数 + 0） 
//"^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$"　　//负浮点数 
//"^(-?\d+)(\.\d+)?$"　　//浮点数 
//"^[A-Za-z]+$"　　//由26个英文字母组成的字符串 
//"^[A-Z]+$"　　//由26个英文字母的大写组成的字符串 
//"^[a-z]+$"　　//由26个英文字母的小写组成的字符串 
//"^[A-Za-z0-9]+$"　　//由数字和26个英文字母组成的字符串 
//"^\w+$"　　//由数字、26个英文字母或者下划线组成的字符串 
//"^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$"　　　　//email地址 
//"^[a-zA-z]+://(\w+(-\w+)*)(\.(\w+(-\w+)*))*(\?\S*)?$"　　//url
///^(d{2}|d{4})-((0([1-9]{1}))|(1[1|2]))-(([0-2]([1-9]{1}))|(3[0|1]))$/ // 年-月-日
///^((0([1-9]{1}))|(1[1|2]))/(([0-2]([1-9]{1}))|(3[0|1]))/(d{2}|d{4})$/ // 月/日/年
//"^([w-.]+)@(([[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.)|(([w-]+.)+))([a-zA-Z]{2,4}|[0-9]{1,3})(]?)$" //Emil
//"(d+-)?(d{4}-?d{7}|d{3}-?d{8}|^d{7,8})(-d+)?" //电话号码
//"^(d{1,2}|1dd|2[0-4]d|25[0-5]).(d{1,2}|1dd|2[0-4]d|25[0-5]).(d{1,2}|1dd|2[0-4]d|25[0-5]).(d{1,2}|1dd|2[0-4]d|25[0-5])$" //IP地址



//匹配中文字符的正则表达式： [\u4e00-\u9fa5]
//匹配双字节字符(包括汉字在内)：[^\x00-\xff]
//匹配空行的正则表达式：\n[\s| ]*\r
//匹配HTML标记的正则表达式：/<(.*)>.*<\/\1>|<(.*) \/>/
//匹配首尾空格的正则表达式：(^\s*)|(\s*$)
//匹配Email地址的正则表达式：\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*
//匹配网址URL的正则表达式：^[a-zA-z]+://(\\w+(-\\w+)*)(\\.(\\w+(-\\w+)*))*(\\?\\S*)?$
//匹配帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线)：^[a-zA-Z][a-zA-Z0-9_]{4,15}$
//匹配国内电话号码：(\d{3}-|\d{4}-)?(\d{8}|\d{7})?
//匹配腾讯QQ号：^[1-9]*[1-9][0-9]*$

//下面是常用的正则表达式——
//验证数字：^[0-9]*$
//验证n位的数字：^d{n}$
//验证至少n位数字：^d{n,}$
//验证m-n位的数字：^d{m,n}$
//验证零和非零开头的数字：^(0|[1-9][0-9]*)$
//验证有两位小数的正实数：^[0-9]+(.[0-9]{2})?$
//验证有1-3位小数的正实数：^[0-9]+(.[0-9]{1,3})?$
//验证非零的正整数：^+?[1-9][0-9]*$
//验证非零的负整数：^-[1-9][0-9]*$
//验证非负整数（正整数 + 0） ^d+$
//验证非正整数（负整数 + 0） ^((-d+)|(0+))$
//验证长度为3的字符：^.{3}$
//验证由26个英文字母组成的字符串：^[A-Za-z]+$
//验证由26个大写英文字母组成的字符串：^[A-Z]+$
//验证由26个小写英文字母组成的字符串：^[a-z]+$
//验证由数字和26个英文字母组成的字符串：^[A-Za-z0-9]+$
//验证由数字、26个英文字母或者下划线组成的字符串：^w+$
//验证用户密码:^[a-zA-Z]w{5,17}$ 正确格式为：以字母开头，长度在6-18之间，只能包含字符、数字和下划线。
//验证是否含有 ^%&',;=?$" 等字符：[^%&',;=?$x22]+
//验证汉字：^[u4e00-u9fa5],{0,}$
//验证Email地址：^w+[-+.]w+)*@w+([-.]w+)*.w+([-.]w+)*$
//验证InternetURL：^http://([w-]+.)+[w-]+(/[w-./?%&=]*)?$ ；^[a-zA-z]+://(w+(-w+)*)(.(w+(-w+)*))*(?S*)?$
//验证电话号码：^((d{3,4})|d{3,4}-)?d{7,8}$：--正确格式为：XXXX-XXXXXXX，XXXX-XXXXXXXX，XXX-XXXXXXX，XXX-XXXXXXXX，XXXXXXX，XXXXXXXX。
//验证身份证号（15位或18位数字）：^d{15}|d{}18$
//验证一年的12个月：^(0?[1-9]|1[0-2])$ 正确格式为：“01”-“09”和“1”“12”
//验证一个月的31天：^((0?[1-9])|((1|2)[0-9])|30|31)$ 正确格式为：01、09和1、31。
//整数：^-?d+$
//非负浮点数（正浮点数 + 0）：^d+(.d+)?$
//正浮点数 ^(([0-9]+.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*.[0-9]+)|([0-9]*[1-9][0-9]*))$
//非正浮点数（负浮点数 + 0） ^((-d+(.d+)?)|(0+(.0+)?))$
//负浮点数 ^(-(([0-9]+.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*.[0-9]+)|([0-9]*[1-9][0-9]*)))$
//浮点数 ^(-?d+)(.d+)?$

function isRegisterUserName(s) 
{
    var patrn = /^[a-zA-Z]{1}([a-zA-Z0-9]|[._]){4,19}$/;
    if (!patrn.exec(s)) return false
    return true
} 